Revit 2026 API

# LoadCaseIsLoadCaseSubcategoryId Method

---

Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsLoadCaseSubcategoryId(
	ElementId loadCaseSubcategoryId
)
```
```vb
Public Function IsLoadCaseSubcategoryId (
	loadCaseSubcategoryId As ElementId
) As Boolean
```
```cpp
public:
bool IsLoadCaseSubcategoryId(
	ElementId^ loadCaseSubcategoryId
)
```
```fsharp
member IsLoadCaseSubcategoryId :
        loadCaseSubcategoryId : ElementId -> bool
```

#### Parameters

loadCaseSubcategoryId ElementId
     The ID to check.

#### Return Value

Boolean True if the ID refers to load case category element, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Built-in structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic

#### Reference

LoadCase Class

Autodesk.Revit.DB.Structure Namespace